public class lesson_11_02 {
    //Создание объекта.
    //Чтобы создать объект, нужно использовать оператор new. Выглядит создание объекта примерно так:
    //new Класс(параметры)

    //Чаще всего, сразу после создания объекта, ссылку на него мы сохраняем в переменную,
    //которая тоже очень часто имеет такой же тип, что и создаваемый объект. Поэтому обычно вы видите код создания объекта похожим на такой:
    //Класс имя = new Класс(параметры)
    //Где Класс имя — это создание новой переменной, а код справа от знака равенства — это создание нового объекта типа Класс.

    //Код	                                    Примечание
    //Object o = new Object();                  Создание объекта типа Object
    //Cat pet = new Cat();                      Создание объекта типа Cat
    //Scanner console = new Scanner(System.in)  Создание объекта типа Scanner

    //Очень часто программисты называют переменные таким же именем, что и классы, только с маленькой буквы.
    //BufferedReader bufferedReader = new BufferedReader( reader );
    //Cat cat = new Cat();
    //PersonInfo personInfo = new PersonInfo();

    //Слева от знака равенства — создание переменной. Справа — создание объекта.


}
